trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыПоСекциямДокумента/ШтрихкодыПоСекциямДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="29531af2-dba3-42ad-9c7b-151933be8b21">
  <name>ШтрихкодыПоСекциямДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3fedc95-0bd1-421a-ad42-ed63e3217997">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fd209668-9498-4546-b274-099b5d89c19b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1c7dae82-7a35-419b-b8a5-0e1eb74689fc">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="88471c71-e486-452f-9ae2-871decbd42a1">
    <name>ДатаФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="01df1321-4602-41fe-ab9e-f0664ac3ee8e">
    <name>Проверен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ecc0fbe7-2de8-43e0-a093-25a7bb457aa0">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="3a52a111-7ca0-4772-889b-7605de702891">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="de290d7b-89b5-474a-804d-6b8a1415bf4d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостояниеСборкиЗаказов/СостояниеСборкиЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="18c8b37a-1448-43e5-97b0-38014a38f105">
  <name>СостояниеСборкиЗаказов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="e37c7e52-e1c2-4db9-946d-62376e390269">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e33ec23f-2682-4798-b2ee-24a74a957013">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4e792c62-3ce2-4052-a9a4-2adf1345b5c2">
    <name>Наборщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a708eb93-1ef4-4774-b62b-d1e7166248ac">
    <name>ЯПХ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2ef5c213-026c-4aea-88b7-d85faaf0a5b0">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cb6741a4-3e28-4aaa-90f2-80af601c941d">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/РСОбщийМодульВызовСервера/Module.bsl
Функция ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение) Экспорт
	
	Значение = НРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 16 + Найти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Формат(Результат, "ЧГ=0");
	
КонецФункции

Функция ПользовательИспользуетПроверкуПоШтрихкоду(ТекПользователь) Экспорт
	
	СвойствоИспШК = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Использование проверки накладных по штрихкоду"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", ТекПользователь);
	Запрос.УстановитьПараметр("Свойство", СвойствоИспШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИспользуетсяПроверкаШК = Ложь;
	
	Если Выборка.Следующий() Тогда
		ИспользуетсяПроверкаШК = Выборка.Значение;
	КонецЕсли;
	
	Возврат ИспользуетсяПроверкаШК;
	
КонецФункции

Процедура СозданиеШтрихкодовПоСекциям(ДополнительныеСвойства, Объект, Изменилась, Отказ) Экспорт
	
	ЕстьШтрихкоды= ЕстьШтрихкодыПоСекции(Объект.Ссылка);
	Если Не Изменилась И ЕстьШтрихкоды Тогда
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			Если ЗначениеЗаполнено(Объект.Кассир) Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") Тогда
			Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит ИЛИ Объект.СвернутИзРеализации Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ДатаФормирования = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	РеализацияТоваровУслугТовары.Назначение КАК Назначение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(ЧекККМТовары.Сумма),
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ЧекККМТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ЧекККМТовары.Ссылка.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	ЧекККМТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Объект.Ссылка);
	Если Не ЕстьШтрихкоды ИЛИ Изменилась Тогда //Если нет штрихкодов или сумма изменилась
		Пока Выборка.Следующий() Цикл
			Запись = РСНЗШтрихкодыПоСекциям.Добавить();
			
			Запись.Документ			= Объект.Ссылка;
			Если Выборка.ЭтоУслуга Тогда
				Запись.Штрихкод			= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Объект.Ссылка.УникальныйИдентификатор()),"-","")));
			Иначе
				Запись.Штрихкод			= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","")));
			КонецЕсли;
			Запись.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Объект.Ссылка); 
			Запись.ДатаФормирования	= ДатаФормирования;
			Запись.Проверен			= Ложь;
			Запись.Сумма			= Выборка.Сумма;
			Запись.Секция			= ?(ЗначениеЗаполнено(Выборка.Секция), Выборка.Секция, "");
			Запись.Назначение			= Выборка.Назначение;
		КонецЦикла;
		
		Попытка
			РСНЗШтрихкодыПоСекциям.Записать(истина);
		Исключение
			СообщениеОбОшибке = Новый СообщениеПользователю;
			СообщениеОбОшибке.Текст = "Ошибка формирования штрихкода по секциям документа!";
			СообщениеОбОшибке.Сообщить();
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
Процедура УдалениеСвязанныхДанныхПоРегистрамСведений(Объект, Отказ) Экспорт
	
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Объект.Ссылка);
	
	РСНЗСостояниеСборкиЗаказов = РегистрыСведений.СостояниеСборкиЗаказов.СоздатьНаборЗаписей();
	РСНЗСостояниеСборкиЗаказов.Отбор.Документ.Установить(Объект.Ссылка);
	
	Попытка
		РСНЗШтрихкодыПоСекциям.Записать(Истина);
		РСНЗСостояниеСборкиЗаказов.Записать(Истина);
	Исключение
		Отказ = Истина;
	КонецПопытки
	
КонецПроцедуры

Процедура ОбновитьШтрихкодыПоСекциям(Объект, Отказ) Экспорт
	
	СсылкаНаДокумент = Объект.Ссылка;
	СуммаПоСекциям = ПолучитьСуммуПоСекциям(СсылкаНаДокумент);
	
	Если СуммаПоСекциям <> Объект.СуммаДокумента ИЛИ СсылкаНаДокумент.Склад <> Объект.Склад Тогда
		ЗаписатьШтрихкодыПоСекциямДокумента(СсылкаНаДокумент, Отказ)			
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискШтрихкодаСекцииСервер(Ссылка, ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ
	|	И ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьШтрихкодыПоСекции(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция КАК Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение КАК Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСуммуПоСекциям(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ШтрихкодыПоСекциямДокумента.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПоискДокументаПоШК(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция КАК Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение КАК Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма КАК Сумма,
	|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ПоискШтрихкодаПОQRкоду(QRкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.QRкод = &QRкод";
	
	Запрос.УстановитьПараметр("QRкод", QRкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Штрихкод;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции


Процедура ЗаписатьШтрихкодыПоСекциямДокумента(Ссылка, Отказ) Экспорт
		
	Выборка = ПолучитьШтрихкодыПоСекциямДокумента(Ссылка);
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаФормирования = ТекущаяДата();
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Ссылка);
	Пока Выборка.Следующий() Цикл
		Запись = РСНЗШтрихкодыПоСекциям.Добавить();
		
		Запись.Документ = Ссылка;
		Если Выборка.ЭтоУслуга Тогда
			Запись.Штрихкод = РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()),"-","")));
		Иначе
			Запись.Штрихкод	= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","")));
		КонецЕсли;
		Запись.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Ссылка); 
		Запись.ДатаФормирования	= ДатаФормирования;
		Запись.Проверен	= Ложь;
		Запись.Сумма = Выборка.Сумма;
		Запись.Секция = ?(ЗначениеЗаполнено(Выборка.Секция), Выборка.Секция, "");
		Запись.Назначение = Выборка.Назначение;
	КонецЦикла;
	
	Попытка
		РСНЗШтрихкодыПоСекциям.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("ЗаписатьШтрихкодыПоСекциямДокумента", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Ошибка формирования штрихкода по секциям документа!";
		СообщениеОбОшибке.Сообщить();
		Отказ = Истина;
	КонецПопытки;
		
КонецПроцедуры 

Функция ПолучитьШтрихкодыПоСекциямДокумента(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	РеализацияТоваровУслугТовары.Назначение КАК Назначение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(ЧекККМТовары.Сумма),
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ЧекККМТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ЧекККМТовары.Ссылка.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	ЧекККМТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции
